### Fathia Nuq Qamarina
### - 2009106012
### - KB A1 2020

#### Import & Read Data

In [61]:
import pandas as pd
from tabulate import tabulate
df = pd.read_csv('Employee.csv')
df.head()

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1

#### 1. Menampilkan jumlah record, nama attribute, jumlah attribute dengan tipe objek, jumlah attribute dengan tipe angka, jumlah attribute yang memiliki nilai null.

#### Menampilkan Jumlah record & Jumlah Attribute

In [62]:
df.shape

(4653, 9)

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4653 entries, 0 to 4652
Data columns (total 9 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Education                  4653 non-null   object
 1   JoiningYear                4653 non-null   int64
 2   City                       4653 non-null   object
 3   PaymentTier                4653 non-null   int64
 4   Age                        4653 non-null   int64
 5   Gender                     4653 non-null   object
 6   EverBenched                4653 non-null   object
 7   ExperienceInCurrentDomain  4653 non-null   int64
 8   LeaveOrNot                 4653 non-null   int64
dtypes: int64(5), object(4)
memory usage: 327.3+ KB

In [64]:
# jumlah record
jmlRecord = len(df)

# nama attribute
namaAtt = list(df.columns)
namaAtt = ",\n".join(namaAtt)

# jumlah attribute dengan tipe objek
attObject = len(df.dtypes[df.dtypes == 'object'])

# jumlah atribut dengan tipe angka
attInt = len(df.dtypes[df.dtypes == 'int64'])

## jumlah atribut yang memiliki nilai null
attNull = df.isna().any().sum()

#### Informasi Dataset

In [65]:

print ("Jumlah Record : ",jmlRecord,"\n")
print ("Nama Attribute : ",namaAtt,"\n")
print ("Jumlah Attribute bertipe data object : ",attObject,"\n")
print ("Jumlah Attribute bertipe data angka : ",attInt,"\n")
print ("Jumlah Attribute yang memiliki nilai null : ",attNull,"\n")

Jumlah Record :  4653

Nama Attribute :  Education,
JoiningYear,
City,
PaymentTier,
Age,
Gender,
EverBenched,
ExperienceInCurrentDomain,
LeaveOrNot

Jumlah Attribute bertipe data object :  4

Jumlah Attribute bertipe data angka :  5

Jumlah Attribute yang memiliki nilai null :  0

#### 2. Memasukkan informasi di atas dalam dictionary dengan key sesuai nama informasinya. Tampilkan isi dari dictionary tersebut sebagus mungkin.

In [66]:
infodataset = {
    'Jumlah Record' : [jmlRecord],
    'Nama Attribute': [namaAtt],
    'Jumlah Attribute bertipe Object' : [attObject],
    'Jumlah Attribute bertipe Angka' : [attInt],
    'Jumlah Attribute dengan nilai Null' : [attNull]
}

In [67]:
tabel = pd.DataFrame(infodataset)
print(tabulate(tabel, headers='keys', tablefmt='psql',showindex=False))

+-----------------+----------------------------+-----------------------------------+----------------------------------+--------------------------------------+
|   Jumlah Record | Nama Attribute             |   Jumlah Attribute bertipe Object |   Jumlah Attribute bertipe Angka |   Jumlah Attribute dengan nilai Null |
|-----------------+----------------------------+-----------------------------------+----------------------------------+--------------------------------------|
|            4653 | Education,                 |                                 4 |                                5 |                                    0 |
|                 | JoiningYear,               |                                   |                                  |                                      |
|                 | City,                      |                                   |                                  |                                      |
|                 | PaymentTier,               |                                   |                                  |                                      |
|                 | Age,                       |                                   |                                  |                                      |
|                 | Gender,                    |                                   |                                  |                                      |
|                 | EverBenched,               |                                   |                                  |                                      |
|                 | ExperienceInCurrentDomain, |                                   |                                  |                                      |
|                 | LeaveOrNot                 |                                   |                                  |                                      |
+-----------------+----------------------------+-----------------------------------+----------------------------------+--------------------------------------+

#### 3. Menampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.

In [68]:
df.describe()

,JoiningYear,PaymentTier,Age,ExperienceInCurrentDomain,LeaveOrNot
count,4653.000000,4653.000000,4653.000000,4653.000000,4653.000000
mean,2015.062970,2.698259,29.393295,2.905652,0.343864
std,1.863377,0.561435,4.826087,1.558240,0.475047
min,2012.000000,1.000000,22.000000,0.000000,0.000000
25%,2013.000000,3.000000,26.000000,2.000000,0.000000
50%,2015.000000,3.000000,28.000000,3.000000,0.000000
75%,2017.000000,3.000000,32.000000,4.000000,1.000000
max,2018.000000,3.000000,41.000000,7.000000,1.000000

#### 4. Menampilkan nilai korelasi attribute bertipe angka

In [69]:
df.corr()

,JoiningYear,PaymentTier,Age,ExperienceInCurrentDomain,LeaveOrNot
JoiningYear,1.000000,-0.096078,0.013165,-0.036525,0.181705
PaymentTier,-0.096078,1.000000,0.007631,0.018314,-0.197638
Age,0.013165,0.007631,1.000000,-0.134643,-0.051126
ExperienceInCurrentDomain,-0.036525,0.018314,-0.134643,1.000000,-0.030504
LeaveOrNot,0.181705,-0.197638,-0.051126,-0.030504,1.000000

#### 5. Mengubah nilai salah satu attribute bertipe angka menjadi desimal 3 angka dibelakang koma jika tidak ada, lakukan sebaliknya (dari desimal menjadi bilangan bulat).

In [70]:
df['PaymentTier'].head()

0    3
1    1
2    3
3    3
4    3
Name: PaymentTier, dtype: int64

In [71]:
df.update(df['PaymentTier']*0.001) #mengalikan dengan desimal 3 angka dibelakang koma.

In [72]:
df['PaymentTier'].head()

0    0.003
1    0.001
2    0.003
3    0.003
4    0.003
Name: PaymentTier, dtype: float64

#### 6. Menampilkan 10 record pertama dari attribute bertipe angka

In [73]:
df[['JoiningYear','PaymentTier','Age','ExperienceInCurrentDomain','LeaveOrNot']].head(10)

   JoiningYear  PaymentTier  Age  ExperienceInCurrentDomain  LeaveOrNot
0         2017        0.003   34                          0           0
1         2013        0.001   28                          3           1
2         2014        0.003   38                          2           0
3         2016        0.003   27                          5           1
4         2017        0.003   24                          2           1
5         2016        0.003   22                          0           0
6         2015        0.003   38                          0           0
7         2016        0.003   34                          2           1
8         2016        0.003   23                          1           0
9         2017        0.002   37                          2           0

In [74]:
dfAngka= df.select_dtypes(include=['int64','float64'])
dfAngka.head(10)

   JoiningYear  PaymentTier  Age  ExperienceInCurrentDomain  LeaveOrNot
0         2017        0.003   34                          0           0
1         2013        0.001   28                          3           1
2         2014        0.003   38                          2           0
3         2016        0.003   27                          5           1
4         2017        0.003   24                          2           1
5         2016        0.003   22                          0           0
6         2015        0.003   38                          0           0
7         2016        0.003   34                          2           1
8         2016        0.003   23                          1           0
9         2017        0.002   37                          2           0

#### 7. Simpan dataset dengan attribute bertipe angka ke dalam file CSV.

In [75]:
dfAngka.to_csv('Attribute_tipe_Angka.csv', index=False)